Automatisierte Frontend mit CI ergänzt, dazu Mermaid in die Doku eingebungen
